class MessageTexts {
    companion object {
        val GREETING = """
            Вітаємо тебе в студентському просторі Campus Ukraine!
            Це сучасний, комфортний, безкоштовний простір для твого навчання та відпочинку, для самостійної роботи або підготовки проєктів з друзями.
            
            З Пн по Пт ми чекаємо тебе на free space з 14:00 до 21:30 – приходь навчатись, займатись своїми справами, грати в настільні ігри.
            Вечорами тут проходять різні заходи.
            
            Ми - спільнота студентів, яка надихає!
            
            Якщо ти у нас вперше – заповни, будь ласка, анкету та ознайомся з правилами використання простору.
        """.trimIndent()
        const val ASK_FIRST_NAME = "Як тебе звуть? (просто ім'я)"
        const val ASK_LAST_NAME = "А прізвище?"
        const val ASK_UNIVERSITY = "Приємно познайомитися, %s!\nЗ якого ти університету?\n(обери зі списку або напиши)"
        const val ASK_YEAR_STUDY = "Який курс?"
        const val ASK_STUD_PRO = "А як ти дізнався про Student Prostir?\n(обери зі списку або напиши)"
        const val ASK_WHO_I_AM = "Також, будь-ласка, скажи чи тобі було б цікаво дізнатись більше про наш проєкт ЯХТО?"
        val MINI_WHO_I_AM = """
                ЯХТО - це безкоштовний коучінг від волонтерів Campus Ukraine для розвитку студентів.
                Це три особисті зустрічі з волонтером проекту.
                Завдяки дружній атмосфері, матеріалам проекту, досвіду сотень подібних зустрічей, коучінг проходить легко.
                Але головне – ЯХТО життєзмінюючий!
        """.trimIndent()
        const val ASK_LECTORIUM = "Можливо тебе зацікавлять семінари, тематичні лекції та інші проєкти саморозвитку?"
        const val ASK_RULES = "І наостанок, будь-ласка, ознайомся з правилами перебування в Student Prostir"
        val RULES = """
                Загальні правила перебування в Student Prostir
                
                #1 При відвідуванні Free Spaсe обов’язково зареєструватися (заповнити анкету)
                
                #2 Слідкуй за чистотою і не забудь прибрати після себе. Використаний посуд став в посудомийну машину.
                
                #3 Поважай себе та інших. Не створюй перешкоди і незручності іншим під час Free Spaсe, давай не будемо шуміти та нецензурно висловлюватися.
                
                #4 Потрібно класти речі на свої місця (посуд, ігри).
                
                #5 Не залишайте особисті речі без нагляду.
                
                #6 Help yourself. Можна робити собі каву\чай та користуватись кухнею з дозволу адміністратора.
                
                #7 Не можна заходити в кімнату в конференц залі і комірчини з наліпками Staff Only.
                
                #8 В туалеті дотримуватися чистоти, засоби особистої гігієни необхідно викидати в смітник.
                
                #9 Забороняється: палити в приміщенні та прилеглій території (в тому числі і електронні сигарети). Перебувати в стані алкогольного або наркотичного сп'яніння; вживати алкогольні напої, наркотичні, інші п'янкі речовини.
                
                #10 Збитки і шкоду, заподіяні внаслідок дії користувачів, відшкодовуються в повному обсязі :) 
        """.trimIndent()
        const val AGREE = "Я ознайомлений та погоджуюсь з правилами користування простором"
        const val FORCE_AGREE = "Правила є правила, перед тим як користуватися Student Prostir ти маєш ознайомитися і погодитися з ними"
        const val FINISH_REGISTRATION = "Це все, дякую тобі, тепер в майбутньому тобі достатньо буде натиснути \"Зачекінитися\"\nWi-Fi - Campus Ukraine\nPassword - StudentProstir2018"
        const val THANKS = "Дякую, Have Fun! :)"
        const val WANNA_CHECKIN = "Ти знаходишся в Student Prostir і бажаєш зачекінитися?"
        const val ALREADY_CHECKED_IN = "Здається ти вже сьогодні чекінився.."
        const val SUBSCRIBED = "Дякую, ти знайдеш наш телеграм канал за наступним посиланням"
        const val WANNA_FEEDBACK = "Напиши мені відгук"
        const val RESULT_FEEDBACK = "Дякую, зворотній зв'язок зі студентами допомагає нам вдосконалюватися!"
        const val OK = "Гаразд"
        const val YES = "Так"
        const val YES_EXTENDED = "Так – розкажіть мені більше."
        const val NO = "Ні"
        const val NO_EXTENDED = "Поки що не цікавить."
        const val DEFAULT = "Не розумію тебе.."
        val WHO_I_AM = """
            Проект ЯХТО
            
            Відбувається протягом року у різних Campus-містах. Новий сезон проекту несе запитання новим людям.
            
            Хто ти? Студент, син, столяр третього розряду, професор, моряк, технар чи гуманітарій? Це умовності. Це не відповіді на запитання «хто я?» Твоя справжня ідентичність значно глибша. Саме вона визначає твої мрії, оточення, самооцінку.
            
            Для чого ти живеш? Куди рухаєшся? В чому твоя цінність? Де заховані піастри? Як культура довкола впливає на тебе? Що таке ідентичність? Ці питання гаряче обговорюють на проекті ЯХТО, що проводиться студентами для студентів.
            
            Щоб ти міг знайти себе, ми створили цей волонтерський проект. ЯХТО не для слабаків, потребує сміливості й мужності, адже ти справді можеш зустрітися із собою.

            Індивідуальні коуч-зустрічі із волонтерами та євротести – це у нас.
            
            Зрозумій свої мотиви, дізнайся своє покликання та орієнтири для прийняття рішень. Познайомся зі студентами, які живуть свідомо й активно із ЯХТО!
        """.trimIndent()

        const val WHO_I_AM_MORE_INFO_TEXT = "Більше інформації"
        const val WHO_I_AM_MORE_INFO_LINK = "http://kyivcampus.tilda.ws/whoiam"
        const val WHO_I_AM_REGISTRATION_TEXT = "Реєстрація"
        const val WHO_I_AM_REGISTRATION_LINK = "https://docs.google.com/forms/d/e/1FAIpQLSfWfOBE2w3eFYX250FG4ByQAEMYf540dWMZ1UVycLqbY2lwgg/viewform"
        const val INVITE_CAMPUS_CHANNEL_TEXT = "Підписатися"
        const val INVITE_CAMPUS_CHANNEL_LINK = "https://t.me/joinchat/AAAAAEw7Hu59D_KNUemEnQ"
    }
}
