class MessageTexts {
    companion object {
        val GREETING = """
            Вітаємо тебе в студентському просторі Campus Ukraine!
            Це сучасний, комфортний, безкоштовний простір для твого навчання та відпочинку, для самостійної роботи або підготовки проєктів з друзями.
            
            З Пн по Пт ми чекаємо тебе на free space з 14:00 до 21:30 – приходь навчатись, займатись своїми справами, грати в настільні ігри.
            Вечорами тут проходять різні заходи.
            
            Ми - спільнота студентів, яка надихає!
            
            Якщо ти у нас вперше – заповни, будь ласка, анкету та ознайомся з правилами використання простору.
        """.trimIndent()
        const val ASK_FIRST_NAME = "Як тебе звуть? (просто ім'я)"
        const val ASK_LAST_NAME = "А прізвище?"
        const val ASK_UNIVERSITY = "Приємно познайомитися, %s!\nЗ якого ти університету?\n(обери зі списку або напиши)"
        const val ASK_YEAR_STUDY = "А який курс?"
        const val ASK_STUD_PRO = "І останнє, як ти дізнався про Student Prostir?\n(обери зі списку або напиши)"
        const val FINISH_REGISTRATION = "Це все, дякую тобі, тепер в майбутньому тобі достатньо буде натиснути \"Зачекінитися\"\nЯкщо бажаєш, можеш підписатися на наші новини.\nHave Fun! :)"
        const val THANKS = "Дякую, Have Fun! :)"
        const val ALREADY_CHECKED_IN = "Здається ти вже сьогодні чекінився.."
        const val WANNA_SUBSCRIBE = "Маєш бажання отримувати новини про івенти в Student Prostir?"
        const val WANNA_UNSUBSCRIBE = "Бачу ти вже підписаний на наші новини, бажаєш відписатися?"
        const val SUBSCRIBED = "Чудово, обіцяю не спамити :)"
        const val UNSUBSCRIBED = "Добре, якщо захочеш знову підписатися, ти знаєш як :)"
        const val WANNA_FEEDBACK = "Напиши мені відгук"
        const val RESULT_FEEDBACK = "Дякую, зворотній зв'язок зі студентами допомагає нам вдосконалюватися!"
        const val OK = "Гаразд"
        const val DEFAULT = "Не розумію тебе.."
        val WHO_I_AM = """
            Проект ЯХТО
            
            Відбувається протягом року у різних Campus-містах. Новий сезон проекту несе запитання новим людям.
            
            Хто ти? Студент, син, столяр третього розряду, професор, моряк, технар чи гуманітарій? Це умовності. Це не відповіді на запитання «хто я?» Твоя справжня ідентичність значно глибша. Саме вона визначає твої мрії, оточення, самооцінку.
            
            Для чого ти живеш? Куди рухаєшся? В чому твоя цінність? Де заховані піастри? Як культура довкола впливає на тебе? Що таке ідентичність? Ці питання гаряче обговорюють на проекті ЯХТО, що проводиться студентами для студентів.
            
            Щоб ти міг знайти себе, ми створили цей волонтерський проект. ЯХТО не для слабаків, потребує сміливості й мужності, адже ти справді можеш зустрітися із собою.

            Індивідуальні коуч-зустрічі із волонтерами та євротести – це у нас.
            
            Зрозумій свої мотиви, дізнайся своє покликання та орієнтири для прийняття рішень. Познайомся зі студентами, які живуть свідомо й активно із ЯХТО!
        """.trimIndent()
    }
}
